const words = [
  'вблизи, поближе;附近;fùjìn',
  'банк;银行;yínháng',
  'пешеход;行人;xíngrén',
  'от.. и до..;离;lí',
  'далёкий;远;yuǎn',
  'как, каким образом;怎么;zěnme',
  'идти, ходить;走;zǒu',
  'в, на (о направлении);往;wǎng',
  'впереди;前面;qiánmian',
  'перед, впереди;前;qián',
  'правая сторона;右面;yòumian',
  'правый;右;yòu',
  'поворачивать, поворачиваться;拐;guǎi',
  'улица;马路;mǎlù',
  'дорога, путь;路;lù',
  'вот-вот;就;jiù',
  'почта;邮局;yóujú',
  'рядом, около;旁边;pángbiān',
  'не за что, пожалуйста;不客气;bùkèqi',
  'склонный церемониться;客气;kèqi',
  'центр города;市中心;shìzhōngxīn',
  'говорить, сообщать;告诉;gàosu',
  'метро;地铁;dìtiě',
  'с;从;cóng',
  'до;到;dào',
  'ворота, вход, у входа;门口;ménkǒu',
  'автобус;公共汽车;gōnggòng qìchē',
  'машина, автомобиль;汽车;qìchē',
  'транспортное средство;车;chē',
  'станция, остановка;站;zhàn',
  'потом, затем;然后;ránhòu',
  'менять, пересаживаться;换;huàn',
  'сходить с (атобуса);下车;xiàchē',
  'ехать на (или верхом);骑;qí',
  'велосипед;自行车;zìxíngchē',
  'задняя сторона, позади;后面;hòumian',
  'левая сторона, слева;左面;zuǒmiàn',
  'на, над, наверху;上面;shàngmian',
  'под, внизу;下面;xiàmiàn',
  'в, внутри;里边;lǐbiān',
  'наружная сторона, снаружи;外面;wàimian',
  'садится в (машину);上车;shàng chē',
  'близкий;近;jìn',
];

const PINYIN_VOWEL_REGEX = /[aeiouü]:?(\d)?/gi;

function vowelToPinyin(vowelAndTone, tone) {
  vowelAndTone = vowelAndTone.replace('u:', 'ü');
  if (tone < 0 || tone > 4) {
    return vowelAndTone
  }
  const map = new Map([
    ['a1', 'ā'], ['a2', 'á'], ['a3', 'ǎ'], ['a4', 'à'],
    ['o1', 'ō'], ['o2', 'ó'], ['o3', 'ǒ'], ['o4', 'ò'],
    ['e1', 'ē'], ['e2', 'é'], ['e3', 'ě'], ['e4', 'è'],
    ['u1', 'ū'], ['u2', 'ú'], ['u3', 'ǔ'], ['u4', 'ù'],
    ['i1', 'ī'], ['i2', 'í'], ['i3', 'ǐ'], ['i4', 'ì'],
    ['ü1', 'ǖ'], ['ü2', 'ǘ'], ['ü3', 'ǚ'], ['ü4', 'ǜ'],
  ]);
  return map.get(vowelAndTone) || vowelAndTone;
}

function wordToPinyin(word) {
  return word.replace(PINYIN_VOWEL_REGEX, vowelToPinyin);
}

words.map(w => w.split(';')).map(([t, h, p]) => {console.log(`{pinyin: '${wordToPinyin(p)}', hieroglyph: '${h}', translate: '${t}', lesson: 8, sound: '8/0.mp3'},`)});
